{"topics":[["мільйон","мати","компанія","отримати","долар","система"],["супутник","spacex","інтернет","перший"],["україна","випадок","covid","тисяча","доба","люди"],["партія","вибір","результат","парламент","опозиція","представник","грузія"],["місяць","вода","nasa","сонячний"]],"docs":[["NASA виділяє гроші на мережу 4G для космосу й апарату, що підстрибує",{"content":"Американське аерокосмічне агентство NASA обрало проєкти, на які загалом витратить 370 мільйонів доларів. Нові розробки мають допомогти в майбутніх місіях NASA на Місяць та Марс.\r\nУсі проєкти поділили на три групи. Перша — розробки технологій управління кріогенними паливами у невагомості. Компанія Lockheed Martin отримала найбільший грант у цій категорії — 89 мільйонів доларів на демонстрацію використання рідкого водню, який вважається «найскладнішим кріогенним паливом для тестування на орбіті».\r\nТакож у цій групі 53 мільйони доларів отримала SpaceX Ілона Маска. Компанія має продемонструвати перекачування 10 тонн рідкого кисню між резервуарами корабля Starship.\r\nКомпанія Eta Space має продемонструвати під час тестового польоту використання кріогенного палива. На це виділили 27 мільйонів доларів. А United Launch Alliance отримали 86 мільйонів для розробки кріогенного палива на основі рідкого кисню та водню.\r\nДруга група — розробки для дослідження поверхні Місяця. Компанія Intuitive Machines отримала грант на 41,6 мільйона доларів та має розробити невеликий апарат, що підстрибуватиме для дослідження місячних кратерів. Він також має доставляти кілограм вантажу на понад 2,5 кілометри та знімати поверхню з високою роздільною здатністю.\r\nВиробник мобільних телефонів Nokia за 14,1 мільйона доларів має запровадити 4G мережу зв'язку в космосі. Система повинна забезпечити зв'язок на поверхні Місяця на великих відстанях, більшу надійність, ніж сучасні стандарти, а також збільшити швидкість передачі даних.\r\nКомпанія Masten Space за 2,8 мільйона повинна створити хімічне джерело тепла та електроенергії, що допоможе пристроям працювати в екстремальних умовах вночі на Місяці.\r\nТретя група — демонстрації систем для точної посадки. Грант отримала одна компанія на 10 мільйонів доларів — Masten. Вона має представити систему для точної посадки та запобігання зіткненням у космосі.","wordsAmount":187,"terms":["nasa","мільйон","долар","мати","місяць","перший","компанія","отримати","spacex","система"]}],["SpaceX запустила чергову партію інтернет-супутників Starlink — на орбіті їх вже понад 800",{"content":"Американська аерокосмічна компанія SpaceX вивела на орбіту Землі чергову партію міні-супутників з проекту Starlink — вони мають роздавати інтернет по всій планеті.\r\nОрбітальну групу супутників поповнили ще 60 апаратів, тепер їх загалом — 833. Вивела супутники у космос ракета-носій Falcon 9, її перша ступінь вдало приземлилась на плавучу платформу в Атлантичному океані, щоби в майбутньому її знову могли використати.\r\nSpaceX зазначила, що проект Starlink поки залишається на початковій стадії, його команда продовжує тестувати систему і збирає дані про роботу супутників.\r\nЦей запуск став 14-им, попередні відбулися на початку жовтня і вересня. Під час 12-ої місії у компанії розповіли про результати тестування супутникового інтернету. Там кажуть, що супутники показали наднизьку затримку і швидкість завантаження понад 100 Мбіт/с.\r\n«Це досить швидко, щоб одночасно передавати декілька фільмів HD», — заявили тоді в компанії.\r\nУ серпні на Reddit опублікували перші дані з бета-тестування супутникового інтернету.\r\nПід час 13-ої місії SpaceX встановила інтернет від Starlink у 20 домах в резервації індіанців племені Хох, яке проживає у віддаленому районі на заході штату Вашингтон. Доступу до інтернету там не було або він був дуже обмеженим.","wordsAmount":115,"terms":["компанія","spacex","партія","супутник","мати","інтернет","перший","система","результат"]}],["В Англії та Австрії запроваджують новий локдаун",{"content":"На тлі збільшення кількості інфікованих коронавірусом в Англії з 5 листопада поновлять суворий карантин. Закриють магазини, паби, ресторани та розважальні заклади. Людей закликають залишатися вдома. Локдаун також чекає на Австрію з 3 листопада.\r\nПро нові обмеження в Англії 31 жовтня оголосив прем’єр-міністр Великої Британії Борис Джонсон, пише The Guardian.\r\n«Ми повинні діяти зараз, щоб стримати цей осінній спалах коронавірусу», — заявив Джонсон і додав, що обмеження повинні діяти до 2 грудня.\r\nЛюдей закликають залишатися вдома тоді, коли це можливо. Водночас їм не заборонятимуть покидати помешкання для навчання, відвідування лікаря, покупок товарів першої необхідності та роботи, якщо вони не можуть працювати з дому.\r\nТакож дозволені прогулянки на свіжому повітрі з членами сім’ї або з однією людиною, яка не є родичем.\r\nЗаклади громадського харчування зможуть працювати на винос та доставляти їжу. Водночас прем’єр наголосив, що розуміє усю важкість ситуації для бізнесу: «Я не будую ілюзій щодо того, на скільки важко буде компаніям, які пережили уже ці складності цього року. Я щиро дуже співчуваю».\r\nШколи, коледжі та університети продовжать роботу, на відміну від періоду весняного локдауну.\r\nТакож Джонсон попередив про заборону на міжнародні поїздки, окрім випадків, коли вони здійснюються з робочою метою.\r\nВ Австрії про посилення карантину повідомив федеральний канцлер Себастіан Курц, передає «Укрінформ». Локдаун запроваджують з 3 листопада і до кінця місяця.\r\nЗа словами глави уряду, в цей час буде заборонено проводити культурні та спортивні заходи (за винятком професійного спорту), а також заходи у сфері дозвілля. З вівторка припиняють прийом туристів заклади готельної сфери, хоча вони зможуть розміщувати людей, які прибувають у відрядження. Також до кінця листопада не працюватимуть заклади громадського харчування: ресторани, бари та кафе зможуть лише доставляти їжу.\r\nЩоб обмежити соціальні контакти, заборонять зустрічі між представниками понад двох родин. Крім того, вводять комендантську годину з 20:00 до 06:00. Водночас це обмеження, яке попередньо діятиме до 12 листопада, не передбачає повну заборону: виходити можна буде по роботі, щоб допомогти іншим людям, для купівлі продуктів чи ліків, а також для пробіжки, прогулянки чи вигулу собак.\r\n«Де-факто це значить, що не можна буде ходити у гості — виходити з власного дому у період часу між 20:00 та 06:00 для зустрічі з іншими людьми», — розповів Курц.","wordsAmount":219,"terms":["люди","перший","компанія","випадок","місяць","представник"]}],["В Україні кількість нових хворих на COVID-19 наблизилася до 9 тисяч — це найбільше з початку пандемії",{"content":"В Україні за минулу добу, 2 листопада, коронавірусне захворювання підтвердили у 8 899 людей — це найбільше з початку пандемії. Також відомо, що вчора 5 100 пацієнтів одужали, а 157 — померли від ускладнень.\r\nПро це свідчать дані карти Ради національної безпеки та оборони щодо поширення коронавірусу.\r\nЗа весь час епідемії в Україні COVID-19 виявили 411 093 випадки інфікування. З них 168 868 людей одужали, а 7 532 — померли від ускладнень. Понад 234 тисячі пацієнтів продовжують лікуватися.\r\nНайбільше хворих за добу виявили у Києві (789), на Харківщині (712), Хмельниччині (506), Донеччині (496), Житомирщині (470) та Одещині (460). Найменше випадків зафіксували у Кіровоградській та Луганській областях — 21 та 121 відповідно.\r\nВосени пандемія почала набирати обертів і в Україні, і майже в усьому світі. Зараз у нас фіксують 6-8 тисяч випадків на добу. Київська школа економіки навіть прогнозує 10 тисяч хворих за добу у листопаді.\r\nУ МОЗ розробили алгоритм дій у разі погіршення ситуації відповідно до чотирьох рівнів небезпеки. Детальніше про них тут. Лише зазначимо, що жорсткий карантин обіцяють по всій Україні, коли щодоби виявлятимуть 11-15 тисяч хворих.\r\nПоки в Україні діє адаптивний карантин, у межах якого регіони поділяють на карантинні зони за рівнем поширення COVID-19.","wordsAmount":109,"terms":["україна","доба","люди","covid","випадок","тисяча"]}],["Виборці, які не обирають президента, голосування поштою та інші особливості американських виборів",{"content":"Пів тижня залишилося до виборів президента США — але їхні результати ми навряд чи дізнаємося скоро. Та й вибори президента США — насправді не лише вибори президента. За опитуваннями, більшість американців підтримують демократа Джо Байдена — але й досі не факт, що він переможе. Чому все так складно? Відповідаємо на головні питання про одну з найважливіших політичних подій у США цього року.\r\nГолосування у США — непряме або багатоступеневе. Головне, що треба розуміти про систему обрання президента в Америці — за нього голосуєте не безпосередньо ви (якщо маєте американське громадянство і щонайменше 18 років), а спеціальна колегія виборщиків. Саме їх ви умовно наділяєте повноваженнями віддавати голоси за кандидатів.\r\nЦі люди — переважно чиновники або місцеві партійні діячі від демократів чи республіканців, яких відбирають на з‘їздах партій. У колегії 538 людей: від кожного штату своя кількість, пропорційна його населенню. До того ж різниця значуща: скажімо, виборщиків від рідного для Джо Байдена Делаверу — лише 3, а від найбільш населеної Каліфорнії — 55.\r\nДля перемоги кандидат має вибороти щонайменше 270 голосів представників у колегії виборщиків. Здебільшого всі голоси виборщиків у штаті забирає кандидат, якого місцеві виборці підтримали найактивніше. Така норма прописана в законодавстві всіх штатів, окрім двох. Якщо її порушити, виборщиків можуть притягнути до відповідальності чи навіть замінити.\r\nВажливу роль на виборах відіграють «штати, які вагаються» (swing states). Це штати з мінливими політичними вподобаннями — на виборах вони не підтримують стабільно республіканців або демократів, як більшість штатів. І часто саме виборщики звідти остаточно вирішують, хто ж буде переможцем. Щоразу набір таких штатів може змінюватися. У 2016-му їх було два, а у 2020-му — аж вісім.\r\nЯкщо поглянемо, де відбувалося найбільше передвиборчих з‘їздів Трампа останнім часом і де найактивніше вів агітацію Байден (до речі, він витратив на це втричі більше коштів за чинного президента), зрозуміємо, про які саме штати йдеться: Айова, Вісконсин, Мічиган, Флорида, Пенсильванія, Огайо, Аризона, Північна Кароліна. За попередніми підрахунками, для впевненої перемоги на виборах Трамп має виграти бодай у шести з цих штатів.\r\nГолосуванням у штатах не обмежуються всі цікавинки президентських виборів. Значний вплив на результат може мати джерімендерінг (gerrymandering, або виборча геометрія / географія). Влада штату має право штучно «перекроювати» межі виборчих округів. Робить вона це, аби бути певною: співвідношення політичних сил у цих округах зміниться і переможе потрібний кандидат. Так, це не зовсім чесно, бо порушує рівність виборчих прав американців.\r\nЗвісно, нинішні вибори й становище кандидатів відрізняються від подій 2016 року. У Байдена не такий високий антирейтинг, як був у Клінтон — а тому не так багато виборців голосуватимуть за Трампа лише тому, що їм не подобається нинішній кандидат від демократів. Та й компромат на Гантера Байдена в американських ЗМІ так активно не розійшовся, як це було з листуванням Клінтон (не в останню чергу тому, що його поширення блокували соцмережі), а тому й шансам Байдена обратися він зашкодить менше.\r\nЗрештою, Трамп уже не «темна конячка» виборів і кандидат для протестного голосування (тобто умовний варіант «проти всіх»). Виборці голосують, зокрема, і за чотири роки його перебування на посаді. Але й без того шанси Трампа переобратися різні моделі прогнозування оцінюють у 5-11%, а букмекерські контори навіть вище — до 35% (у Байдена, до слова, трохи більше ніж 60%). Це не багато, але й не мало.","wordsAmount":301,"terms":["вибір","результат","система","мати","люди","партія","представник"]}],["Компанія Джефа Безоса успішно запустила ракету із системою точного приземлення на Місяць, розробленою NASA",{"content":"Космічна компанія Blue Origin, що належить американському мільярдеру Джефу Безосу, здійснила успішне випробування власної ракети New Shepard із системою точного приземлення на Місяць, розробленою Національним аерокосмічним агентством США (NASA).\r\nПід час випробування, яке тривало загалом трохи більше 10 хвилин, New Shepard злетіла на висоту 106 кілометрів над рівнем моря. Після цього капсула ракети та її ступінь, що повертається, розділилися й окремо приземлилися.\r\nНа борту New Shepard були 12 наукових вантажів, зокрема і система «Демонстрація сенсора виходу з орбіти, спуску і приземлення», розроблена NASA. Ця система має забезпечити високоточне приземлення космічних апаратів на поверхню супутника Землі.\r\nУ перспективі згадана система уможливить довготривалі космічні дослідження, а також зможе застосовуватися і для освоєння Марса, кажуть у Blue Origin. До речі, на борту New Shepard під час тестування були десятки тисяч листівок, на частині з яких були й штампи програми NASA з освоєння Місяця «Артеміда».\r\nДля New Shepard це було 13-те випробування загалом і сьоме успішне випробування поспіль, що в компанії називають рекордом для цієї моделі. Ракета призначена для суборбітальних польотів — як дослідницьких, так і туристичних.\r\nУ серпні Starship — прототип ракети-носія компанії SpaceX Ілона Маска, головного конкурента Безоса в освоєнні космосу, — успішно піднявся в повітря на 150 метрів і приземлився на землю.\r\nЦей «стрибок» став п’ятим (і першим успішним) випробуванням прототипу, який Ілон Маск планує використовувати для запуску космічних місій на Марс і Місяць.\r\nЙдеться про космічну програму «Артеміда», яка має на меті до 2024 року висадити на поверхню супутника Землі «першу жінку й наступних чоловіків». Мета програми полягає в організації наукових досліджень та пошуку економічних вигод від використання Місяця. Йдеться, зокрема, про перетворення супутника на майданчик для подальшого дослідження Марсу.","wordsAmount":190,"terms":["компанія","система","місяць","nasa","мати","супутник","тисяча","spacex","перший"]}],["На парламентських виборах в Грузії з великим відривом перемогла правляча партія",{"content":"У Грузії за результатами підрахунку голосів на парламентських виборах перемогла правляча партія «Грузинська мрія». Прихильники опозиції не погодилися з результатами та почали протест під будівлею парламенту.\r\nПартія «Грузинська мрія» перемогла на парламентських виборах у Грузії з 48,15% голосів.\r\nПісля оголошення результатів у центрі грузинської столиці, Тбілісі, почали збиратися прихильники опозиції, які не згодні з результатами парламентських виборів. На акцію протесту також прийшли представники опозиційних партій.\r\nПротестувальники зібралися під будівлею парламенту Грузії та перекрили рух по проспекту Руставелі. Загалом кілька тисяч людей вимагають нових виборів.\r\nПредставники опозиції заявляють, що вибори були фальсифіковані владою. Незгодні з офіційними підрахунками оголосили, що розпочнуть постійні акції протесту з двома вимогами: призначення позачергових виборів та відставка голови ЦВК зі зміною складу комісії.\r\nНайближчий мітинг опозиція планує провести вже за тиждень — 8 листопада. Передбачається, що у Тбілісі до активістів можуть приєднатися представники регіонів.\r\nНагадаємо, 31 жовтня у Грузії обирали депутатів до парламенту за новими правилами. Так, 120 місць у парламенті заповняться за пропорційними списками, а лише 30 — за мажоритарними. Раніше ж це співвідношення було рівним.\r\nТакож уперше бар'єр проходження в парламент для партій становить лише 1% (раніше він становив 5%). Водночас виборчі блоки мають набрати стільки відсотків, скільки партій входить у блок.\r\nЗа 150 депутатських крісел змагаються 48 партій і 2 виборчих блоки. Фактично завдяки низькому прохідному бар'єру Грузія має величезні шанси отримати багатопартійний парламент.","wordsAmount":150,"terms":["грузія","результат","вибір","партія","опозиція","парламент","представник","тисяча","люди","мати","отримати"]}],["На сонячній стороні Місяця вперше знайшли сліди води",{"content":"Національне аерокосмічне агентство США (NASA) повідомило про виявлення слідів води на тій частині Місяця, де постійно падає сонячне світло. Таке сталося вперше. Що це означає для намірів людства освоїти супутник Землі — і, можливо, обжити його?\r\nОскільки на сонячну сторону Місяця падають прямі сонячні промені, а атмосфери він як такої не має, раніше вважалося, що вода може бути лише там на Місяці, куди Сонце не дістає. Адже від променів вода просто випаровується. Нинішнє відкриття поставило це припущення під сумнів.\r\nЙого здійснила стратосферна обсерваторія для інфрачервоної астрономії (SOFIA) — спільний проєкт NASA та Німецького центру авіації та космонавтики, що існує ще з 2010 року. SOFIA — це, по суті, телескоп, встановлений на борту літака Boeing, що летить на висоті 12-14 кілометрів над Землею: так легше спостерігати за космосом, оскільки не заважають умови атмосфери (як-от підвищена хмарність абощо). Як кажуть у NASA, SOFIA розташована над 99% водної пари земної атмосфери.\r\nSOFIA не спрямована на безпосереднє спостереження за Місяцем (у межах проєкту дослідники спостерігають за різноманітними космічними об’єктами нашої Галактики, зокрема й чорними дірами). Тож воду на сонячній стороні супутника відкрили фактично випадково: у 2018 році дослідники направили телескоп на Місяць у межах випробування. І їм вдалося зафіксувати інфрачервоні хвилі довжиною 6,1 мікрона, які відповідають саме молекулам води.\r\nВоду на Місяці відкривали й раніше — щоправда, стосувалося це саме неосвітленого його боку, захищеного від впливу Сонця. Як показали за останні два десятиліття дані американських і китайських космічних місій, там вода перебуває в замороженому стані. На сонячній стороні Місяця ж виявляли лише сліди гідратації — тобто слідів молекул води в речовинах чи іонах. Але от чи існують молекули води окремо від речовин чи іонів на Місяці, ми досі не знали.\r\n«Це відкриття ставить під сумнів наше розуміння місячної поверхні й порушує інтригуючі питання щодо ресурсів, необхідних для дослідження глибинного космосу», — розмірковує Пол Герц, директор астрофізичного відділення директорату наукових місій NASA. Іншими словами, на основі того, що ми знаємо, води на освітленій Сонцем поверхні Місяця існувати не може; втім вона там існує, і це тепер уперше доведено.","wordsAmount":205,"terms":["nasa","вода","місяць","сонячний","супутник","мати"]}],["У Молдові сьогодні обирали президента",{"content":"У Молдові 1 листопада відбулися вибори президента. Попередні опитування показують, що більшість здобуває чинний очільник країни Ігор Додон, який балотувався як незалежний кандидат, а на другому місці — його головна конкурентка від партії «Дія і солідарність» Майя Санду.\r\nПро це свідчать попередні дані Центральної виборчої комісії Молдови за результатами обробки 42,4% бюлетенів.\r\nЗгідно з ними, Додон отримав 36,5% голосів виборців, а Санду — 30,3%. На третьому місці з 16,1% голосів — кандидат від «Нашої партії» Ренато Усатий, який раніше був союзником Додона, але перейшов в опозицію.\r\nСхожі результати дають і перші опитування виборців, повідомляє NewsMaker. Зокрема, опитування організації Watchdog дає Додону 40,9% голосів, Санду — 34,6%, а Усатому — 11,5%. В опитуванні взяли участь 3900 людей, із них 2500 проголосували; похибка становить 2,5%.\r\nІнші результати, але з таким же розташуванням кандидатів, дає опитування Intellect Group: 28,5% підтримали Ігоря Додона, 21,5% — Майю Санду, 8,8% — Ренато Усатого. У цьому опитуванні взяли участь майже 2600 респондентів.\r\nЦентральна виборча комісія Молдови визнала вибори такими, що відбулися: станом на 21:00 явка становила 42,8% — це означає, що свої голоси віддали понад 1,2 мільйона виборців у Молдові.\r\nУ разі, якщо жоден із кандидатів не набере більше ніж 50% голосів за остаточними результатами голосування, у Молдові 15 листопада відбудеться другий тур виборів.\r\nГолосування на виборах президента в Молдові тривало із 07:00 до 21:00. На закордонних виборчих дільницях ЦВК продовжила голосування через великі черги після наполягання Майї Санду — вона користується більшою підтримкою в молдован за кордоном.\r\nХворі на COVID-19 могли або проголосувати до 15:00 удома, або після 15:00 — на дільницях окремо від інших. Крім того, щоб віддати голос, треба було прийти із власною ручкою й обов’язково в масці — їх також роздавали на вході до дільниць.\r\nДля мешканців невизнаного Молдовою Придністров’я відкрили 42 дільниці для голосування (порівняйте з понад 2000 на решті території країни й 139 — за кордоном). Там, за даними ЦВК станом на 18:00, проголосували 14 тисяч людей.\r\nКрім того, ЦВК заборонила під час виборів підвозити більше ніж 8 людей автобусами до дільниць, визначивши порушення цієї норми як підкуп виборців.","wordsAmount":197,"terms":["партія","результат","отримати","опозиція","перший","люди","мільйон","вибір","covid","тисяча"]}],["У Чумацькому Шляху помітили найменшу планету-сироту",{"content":"Польські астрономи помітили у нашій галактиці, Чумацький Шлях, незвично маленьку планету-сироту. Розміром вона схожа на Землю чи Марс, хоча раніше науковці знаходили такі планети лише розміром як Юпітер (найбільша планета Сонячної системи).\r\nЇї ще називають планетою-мандрівником та міжзоряною планетою. Це космічний об'єкт, маса якого може бути такою ж, як маса планети. На відміну від звичайних планет такі сироти не прив'язані гравітаційно до якоїсь зірки, але можуть мати свої супутники.\r\nВважається, що такі об'єкти можуть з'являтися після того, як через який-небудь катаклізм планети зриваються з орбіти.\r\nОб'єкт OGLE-2016 BLG-1 928 знайшли ще у 2016 році за допомогою мікролінзування. Це метод, який дозволяє спостерігати, як неяскраве і невидиме небесне тіло спотворює світло іншого об'єкта.\r\nТоді астрономи звернули увагу на світло від зорі у сузір'ї Стрільця. Розрахунки показали, що спотворює сяйво зорі об'єкт, який не пов'язаний гравітаційно з жодною зіркою. За словами науковців, це найменша планета-сирота, яку коли-небудь знаходили. Розміром вона схожа на Землю чи Марс.\r\nУ дослідженнях вказують, що планет-мандрівників може бути багато через те, що вже зараз відомо про сотні екзопланет різних розмірів. Планети-сироти можуть з'являтися через взаємодію з більшими екзопланетами, які порушують орбіти менших планет, або через еволюцію зорі-господаря.\r\nЗараз науковці припускають, що невеликі планети-сироти так само поширені в галактиці, як і зорі — надалі дослідники спробують це довести.","wordsAmount":129,"terms":["сонячний","система","супутник"]}],["Україна почала використовувати тести на COVID-19 власного виробництва",{"content":"В Україні почали впроваджувати тест-системи на виявлення COVID-19 вітчизняного виробництва. На закупівлю таких тестів вже виділили приблизно мільярд гривень.\r\nПро це у Верховній Раді заявив міністр охорони здоров'я Максим Степанов.\r\n«Ми завершили випробування українських тест-систем на визначення методом ІФА антиген до SARS-Cov-2 і вже втілюємо їх в Україні», — розповів Степанов.\r\nВін також додав, що Кабінет Міністрів виділив понад 1,2 млрд гривень на тестування. З цієї суми 1 млрд гривень спрямують на закупівлю тестів, що дозволить проводити ще мільйон досліджень на місяць.\r\nЗа минулу добу було здійснено 34 818 тестувань методом ПЛР та 26 018 — методом ІФА. Від початку епідемії в Україні провели 3 379 029 ПЛР-тестувань.\r\nЗа минулу добу, 2 листопада, коронавірусне захворювання підтвердили у 8 899 людей — це найбільше з початку пандемії. Також відомо, що вчора 5 100 пацієнтів одужали, а 157 — померли від ускладнень.\r\nЗа весь час епідемії в Україні COVID-19 виявили 411 093 випадки інфікування. З них 168 868 людей одужали, а 7 532 — померли від ускладнень. Понад 234 тисячі пацієнтів продовжують лікуватися.","wordsAmount":103,"terms":["україна","система","covid","мільйон","місяць","доба","люди","випадок","тисяча"]}],["Чому Європу накрила друга хвиля коронавірусу",{"content":"Більшість нових випадків COVID-19 у Європі можуть бути пов’язані з новою мутацією коронавірусу, яка може бути більш заразною, ніж попередні. Таке припущення висловили вчені з Базельського університету та Швейцарської вищої технічної школи Цюріха (Швейцарія) та іспанського проєкту SeqCOVID.\r\nНауковцям вдалося проаналізувати дані про генетичний матеріал коронавірусу з 12 країн Європи, а також Нової Зеландії та Гонконгу. Так їм вдалося виявити нову його мутацію, 20A.EU1, яка вперше виникла в червні на північному сході Іспанії серед тамтешніх фермерів.\r\nДо жовтня 20A.EU1 уже була зафіксована в усіх досліджуваних країнах. Як припускають автори, найімовірніше, Європою нову мутацію вірусу (а також її різновид, 20A.EU2) рознесли відпочивальники, що влітку були в Іспанії.\r\nДо прикладу, чотири з п’яти нових випадків COVID-19 у Великій Британії, за підрахунками дослідників, припадають саме на нову мутацію. А потрапила вона в країну від 250 окремих людей у липні-серпні. Водночас у Гонконгу 20A.EU1 поширилася лише від одного джерела, а в Новій Зеландії — від трьох окремих випадків зараження.\r\nАвтори висновують, що обмеження й перестороги, ухвалені в Європі в літній час, загалом не змогли запобігти поширенню коронавірусу континентом. Утім щодо природи нової мутації вони висловлюються дуже обережно — бо даних недостатньо.\r\nСтрімке поширення 20A.EU1 та 20A.EU2 може вказувати на те, що ця мутація є заразнішою за попередні, але робити категоричний висновок поки не можуть. Так само їм важко відповісти, чи є ця мутація коронавірусу більш летальною, ніж попередні.\r\nЗа даними Всесвітньої організації охорони здоров'я, саме на Європу нині припадає найбільша кількість виявлених випадків COVID-19 у світі. За 29 жовтня, приміром, понад 239 тисяч європейців дізналися, що в них COVID-19 — а у світі загалом це число склало понад 479 тисяч (тобто у понад два рази більше).\r\nНині в Європі майже 10,3 мільйона людей хворіли чи хворіють коронавірусною хворобою — більше лише на Американському континенті, де це число наблизилося до 20 мільйонів (станом на 29 жовтня).\r\nЄвропейські країни в останні тижні повідомляють про рекордну кількість хворих на COVID-19 або померлих від ускладнень, пов'язаних із коронавірусною хворобою. Низка країн (Ірландія, Велика Британія, Чехія, Італія, Франція, Німеччина) вже оголосили про часткове повернення коронавірусних обмежень, запроваджених навесні.","wordsAmount":210,"terms":["випадок","covid","люди","тисяча","мільйон"]}]],"terms":[["мільйон",{"pos":"NOUN","docs":["NASA виділяє гроші на мережу 4G для космосу й апарату, що підстрибує","У Молдові сьогодні обирали президента","Україна почала використовувати тести на COVID-19 власного виробництва","Чому Європу накрила друга хвиля коронавірусу"],"topic":0,"topicRelation":0.021594577005848114,"ner":"number"}],["мати",{"pos":"VERB","docs":["NASA виділяє гроші на мережу 4G для космосу й апарату, що підстрибує","SpaceX запустила чергову партію інтернет-супутників Starlink — на орбіті їх вже понад 800","Виборці, які не обирають президента, голосування поштою та інші особливості американських виборів","Компанія Джефа Безоса успішно запустила ракету із системою точного приземлення на Місяць, розробленою NASA","На парламентських виборах в Грузії з великим відривом перемогла правляча партія","На сонячній стороні Місяця вперше знайшли сліди води"],"topic":0,"topicRelation":0.010913858921186258}],["компанія",{"pos":"NOUN","docs":["NASA виділяє гроші на мережу 4G для космосу й апарату, що підстрибує","SpaceX запустила чергову партію інтернет-супутників Starlink — на орбіті їх вже понад 800","В Англії та Австрії запроваджують новий локдаун","Компанія Джефа Безоса успішно запустила ракету із системою точного приземлення на Місяць, розробленою NASA"],"topic":0,"topicRelation":0.015415833260161644,"ner":"organisation"}],["отримати",{"pos":"VERB","docs":["NASA виділяє гроші на мережу 4G для космосу й апарату, що підстрибує","На парламентських виборах в Грузії з великим відривом перемогла правляча партія","У Молдові сьогодні обирали президента"],"topic":0,"topicRelation":0.014864254295833252}],["долар",{"pos":"NOUN","docs":["NASA виділяє гроші на мережу 4G для космосу й апарату, що підстрибує"],"topic":0,"topicRelation":0.037307675545075906,"ner":"currency"}],["система",{"pos":"NOUN","docs":["NASA виділяє гроші на мережу 4G для космосу й апарату, що підстрибує","SpaceX запустила чергову партію інтернет-супутників Starlink — на орбіті їх вже понад 800","Виборці, які не обирають президента, голосування поштою та інші особливості американських виборів","Компанія Джефа Безоса успішно запустила ракету із системою точного приземлення на Місяць, розробленою NASA","У Чумацькому Шляху помітили найменшу планету-сироту","Україна почала використовувати тести на COVID-19 власного виробництва"],"topic":0,"topicRelation":0.00599161565138702}],["супутник",{"pos":"NOUN","docs":["SpaceX запустила чергову партію інтернет-супутників Starlink — на орбіті їх вже понад 800","Компанія Джефа Безоса успішно запустила ракету із системою точного приземлення на Місяць, розробленою NASA","На сонячній стороні Місяця вперше знайшли сліди води","У Чумацькому Шляху помітили найменшу планету-сироту"],"topic":1,"topicRelation":0.021048109105100386}],["spacex",{"pos":null,"docs":["NASA виділяє гроші на мережу 4G для космосу й апарату, що підстрибує","SpaceX запустила чергову партію інтернет-супутників Starlink — на орбіті їх вже понад 800","Компанія Джефа Безоса успішно запустила ракету із системою точного приземлення на Місяць, розробленою NASA"],"topic":1,"topicRelation":0.0155077184310474}],["інтернет",{"pos":"NOUN","docs":["SpaceX запустила чергову партію інтернет-супутників Starlink — на орбіті їх вже понад 800"],"topic":1,"topicRelation":0.04525681859033084}],["перший",{"pos":"ADJF","docs":["NASA виділяє гроші на мережу 4G для космосу й апарату, що підстрибує","SpaceX запустила чергову партію інтернет-супутників Starlink — на орбіті їх вже понад 800","В Англії та Австрії запроваджують новий локдаун","Компанія Джефа Безоса успішно запустила ракету із системою точного приземлення на Місяць, розробленою NASA","У Молдові сьогодні обирали президента"],"topic":1,"topicRelation":0.006996606143515631}],["україна",{"pos":"NOUN","docs":["В Україні кількість нових хворих на COVID-19 наблизилася до 9 тисяч — це найбільше з початку пандемії","Україна почала використовувати тести на COVID-19 власного виробництва"],"topic":2,"topicRelation":0.025282228466043263,"ner":"location"}],["випадок",{"pos":"NOUN","docs":["В Англії та Австрії запроваджують новий локдаун","В Україні кількість нових хворих на COVID-19 наблизилася до 9 тисяч — це найбільше з початку пандемії","Україна почала використовувати тести на COVID-19 власного виробництва","Чому Європу накрила друга хвиля коронавірусу"],"topic":2,"topicRelation":0.010883800730706914}],["covid",{"pos":null,"docs":["В Україні кількість нових хворих на COVID-19 наблизилася до 9 тисяч — це найбільше з початку пандемії","У Молдові сьогодні обирали президента","Україна почала використовувати тести на COVID-19 власного виробництва","Чому Європу накрила друга хвиля коронавірусу"],"topic":2,"topicRelation":0.010858171078559638}],["тисяча",{"pos":"NOUN","docs":["В Україні кількість нових хворих на COVID-19 наблизилася до 9 тисяч — це найбільше з початку пандемії","Компанія Джефа Безоса успішно запустила ракету із системою точного приземлення на Місяць, розробленою NASA","На парламентських виборах в Грузії з великим відривом перемогла правляча партія","У Молдові сьогодні обирали президента","Україна почала використовувати тести на COVID-19 власного виробництва","Чому Європу накрила друга хвиля коронавірусу"],"topic":2,"topicRelation":0.006792895063233307,"ner":"number"}],["доба",{"pos":"NOUN","docs":["В Україні кількість нових хворих на COVID-19 наблизилася до 9 тисяч — це найбільше з початку пандемії","Україна почала використовувати тести на COVID-19 власного виробництва"],"topic":2,"topicRelation":0.017454100759070945,"ner":"time"}],["люди",{"pos":"NOUN","docs":["В Англії та Австрії запроваджують новий локдаун","В Україні кількість нових хворих на COVID-19 наблизилася до 9 тисяч — це найбільше з початку пандемії","Виборці, які не обирають президента, голосування поштою та інші особливості американських виборів","На парламентських виборах в Грузії з великим відривом перемогла правляча партія","У Молдові сьогодні обирали президента","Україна почала використовувати тести на COVID-19 власного виробництва","Чому Європу накрила друга хвиля коронавірусу"],"topic":2,"topicRelation":0.004768953797607195}],["партія",{"pos":"NOUN","docs":["SpaceX запустила чергову партію інтернет-супутників Starlink — на орбіті їх вже понад 800","Виборці, які не обирають президента, голосування поштою та інші особливості американських виборів","На парламентських виборах в Грузії з великим відривом перемогла правляча партія","У Молдові сьогодні обирали президента"],"topic":3,"topicRelation":0.019016646316592212,"ner":"organisation"}],["вибір",{"pos":"NOUN","docs":["Виборці, які не обирають президента, голосування поштою та інші особливості американських виборів","На парламентських виборах в Грузії з великим відривом перемогла правляча партія","У Молдові сьогодні обирали президента"],"topic":3,"topicRelation":0.0205421159642234}],["результат",{"pos":"NOUN","docs":["SpaceX запустила чергову партію інтернет-супутників Starlink — на орбіті їх вже понад 800","Виборці, які не обирають президента, голосування поштою та інші особливості американських виборів","На парламентських виборах в Грузії з великим відривом перемогла правляча партія","У Молдові сьогодні обирали президента"],"topic":3,"topicRelation":0.012697389701587517}],["парламент",{"pos":"NOUN","docs":["На парламентських виборах в Грузії з великим відривом перемогла правляча партія"],"topic":3,"topicRelation":0.042993235638469005,"ner":"organisation"}],["опозиція",{"pos":"NOUN","docs":["На парламентських виборах в Грузії з великим відривом перемогла правляча партія","У Молдові сьогодні обирали президента"],"topic":3,"topicRelation":0.020605615382985214}],["представник",{"pos":"NOUN","docs":["В Англії та Австрії запроваджують новий локдаун","Виборці, які не обирають президента, голосування поштою та інші особливості американських виборів","На парламентських виборах в Грузії з великим відривом перемогла правляча партія"],"topic":3,"topicRelation":0.012131854040259828,"ner":"person"}],["грузія",{"pos":"NOUN","docs":["На парламентських виборах в Грузії з великим відривом перемогла правляча партія"],"topic":3,"topicRelation":0.03582769636539084,"ner":"location"}],["місяць",{"pos":"NOUN","docs":["NASA виділяє гроші на мережу 4G для космосу й апарату, що підстрибує","В Англії та Австрії запроваджують новий локдаун","Компанія Джефа Безоса успішно запустила ракету із системою точного приземлення на Місяць, розробленою NASA","На сонячній стороні Місяця вперше знайшли сліди води","Україна почала використовувати тести на COVID-19 власного виробництва"],"topic":4,"topicRelation":0.01702792417050997,"ner":"time"}],["вода",{"pos":"NOUN","docs":["На сонячній стороні Місяця вперше знайшли сліди води"],"topic":4,"topicRelation":0.0503129784825796}],["nasa",{"pos":null,"docs":["NASA виділяє гроші на мережу 4G для космосу й апарату, що підстрибує","Компанія Джефа Безоса успішно запустила ракету із системою точного приземлення на Місяць, розробленою NASA","На сонячній стороні Місяця вперше знайшли сліди води"],"topic":4,"topicRelation":0.012720783657228034}],["сонячний",{"pos":"ADJF","docs":["На сонячній стороні Місяця вперше знайшли сліди води","У Чумацькому Шляху помітили найменшу планету-сироту"],"topic":4,"topicRelation":0.018133762086299715}]],"topicsLimit":"8","termsMaxAmount":50}